app/Controllers/Home.php

SELECT `producto`.*, `categoria_producto`.`categoria_desc`
FROM `producto`
JOIN `categoria_producto` ON `categoria_producto`.`categoria_id`=`producto`.`categoria_id`
WHERE `estado_producto` = 1
AND `stock_producto` > 0
AND `provincia_producto` = 'Mendoza'
SELECT `producto`.*, `categoria_producto`.`categoria_desc`
FROM `producto`
JOIN `categoria_producto` ON `categoria_producto`.`categoria_id`=`producto`.`categoria_id`
WHERE `estado_producto` = 1
AND `stock_producto` > 0
AND `descuento_producto` > 0
---
public function principal()
{
    $producto_model = new producto_model();
    $provincia = $this->request->getGet('provincia');
    if (empty($provincia)) {
        $provincia = 'Mendoza';
    }
 $provincia = $this->request->getGet('provincia') ?? 'Mendoza';


    // Productos filtrados por provincia (para la sección de comidas)
    $builder = $producto_model
        ->select('producto.*, categoria_producto.categoria_desc')
        ->where('estado_producto', 1)
        ->where('stock_producto >', 0)
        ->join('categoria_producto', 'categoria_producto.categoria_id=producto.categoria_id');

    if (!empty($provincia)) {
        $builder->where('provincia_producto', $provincia);
    }

    $data['productos'] = $builder->findAll();

    // --- Usá un nuevo modelo para evitar acumulación de condiciones ---
    $producto_model2 = new producto_model();
    $data['promociones'] = $producto_model2
        ->select('producto.*, categoria_producto.categoria_desc')
        ->where('estado_producto', 1)
        ->where('stock_producto >', 0)
        ->where('descuento_producto >', 0)
        ->join('categoria_producto', 'categoria_producto.categoria_id=producto.categoria_id')
        ->findAll();