app/Controllers/producto_controller.php

SELECT *
FROM `producto`
JOIN `categoria_producto` ON `categoria_producto`.`categoria_id`=`producto`.`categoria_id`
---

    $producto= new producto_model();
    $producto->insert($data);
    return redirect()->route('agregar_producto')->with('mensaje', 'el producto se registro correctamente!');

SELECT *
FROM `producto`
WHERE `id_producto` = '49'
 LIMIT 1
---
public function actualizar_producto()
{
    $request = \Config\Services::request();
    $validation = \Config\Services::validation();
    $producto_model = new producto_model();

    // Obtener el producto actual
    $id = $request->getPost('id');
    $producto = $producto_model->where('id_producto', $id)->first();

SELECT *
FROM `producto`
JOIN `categoria_producto` ON `categoria_producto`.`categoria_id`=`producto`.`categoria_id`
WHERE `estado_producto` = 1
AND `stock_producto` > 0
---
public function listar_productos() {
    $producto_model = new producto_model();
    $data['productos'] = $producto_model->where('estado_producto', 1)->where('stock_producto >', 0)->join('categoria_producto', 'categoria_producto.categoria_id=producto.categoria_id')->findAll();

SELECT *
FROM `producto`
JOIN `categoria_producto` ON `categoria_producto`.`categoria_id`=`producto`.`categoria_id`
WHERE `estado_producto` = 1
AND `stock_producto` > 0
AND `provincia_producto` = 'Corrientes'
---
public function catalogo_productos() {
    $producto_model = new producto_model();
    $provincia = $this->request->getGet('provincia');
    $solo_promociones = $this->request->getGet('solo_promociones');

    $builder = $producto_model
        ->where('estado_producto', 1)
        ->where('stock_producto >', 0)
        ->join('categoria_producto', 'categoria_producto.categoria_id=producto.categoria_id');

    if (!empty($provincia)) {
        $builder->where('provincia_producto', $provincia);
    }
    if ($solo_promociones !== null) {
        $builder->where('descuento_producto >', 0);
    }

    $data['productos'] = $builder->findAll();

SELECT *
FROM `producto`
JOIN `categoria_producto` ON `categoria_producto`.`categoria_id`=`producto`.`categoria_id`
WHERE `estado_producto` = 1
AND `stock_producto` > 0
---
public function menu_bebida() {
    $producto_model = new producto_model();
    $data['productos'] = $producto_model->where('estado_producto', 1)->where('stock_producto >', 0)->join('categoria_producto', 'categoria_producto.categoria_id=producto.categoria_id')->findAll();