app/Controllers/producto_controller.php

public function menu_bebida() {
    $producto_model = new producto_model();
    $data['productos'] = $producto_model->where('estado_producto', 1)->where('stock_producto >', 0)->join('categoria_producto', 'categoria_producto.categoria_id=producto.categoria_id')->findAll();
---
SELECT *
FROM `producto`
JOIN `categoria_producto` ON `categoria_producto`.`categoria_id`=`producto`.`categoria_id`
WHERE `estado_producto` = 1
AND `stock_producto` > 0

public function principal()
{
    $producto_model = new \App\Models\producto_model();
    $provincia = $this->request->getGet('provincia');

    // Productos filtrados por provincia (para la sección de comidas)
    $builder = $producto_model
        ->select('producto.*, categoria_producto.categoria_desc')
        ->where('estado_producto', 1)
        ->where('stock_producto >', 0)
        ->join('categoria_producto', 'categoria_producto.categoria_id=producto.categoria_id');

    if (!empty($provincia)) {
        $builder->where('provincia_producto', $provincia);
    }

    $data['productos'] = $builder->findAll();
---
SELECT *
FROM `producto`
JOIN `categoria_producto` ON `categoria_producto`.`categoria_id`=`producto`.`categoria_id`
WHERE `estado_producto` = 1
AND `stock_producto` > 0