app/Controllers/sesion_controller.php

SELECT *
FROM `persona`
WHERE `correo_persona` = 'diamelaacosta2004@gmail.com'
 LIMIT 1
---
public function verificar_login()
{
    $session = session();
    $request = \Config\Services::request();
    $correo = $request->getPost('correo');
    $pass = $request->getPost('pass');

    $modelo = new \App\Models\UserModel();
    $usuario = $modelo->where('correo_persona', $correo)->first();