app/Controllers/Ventas_controller.php

SELECT `ventas`.*, `persona`.`nombre_persona` AS `nombre_persona`
FROM `ventas`
JOIN `persona` ON `persona`.`id_persona` = `ventas`.`id_persona`
WHERE `fecha_venta` >= '2025-06-19'
AND `fecha_venta` <= '2025-06-19'
---
public function listar_ventas()
{
    $desde = $this->request->getGet('desde');
    $hasta = $this->request->getGet('hasta');
    $metodoEntrega = $this->request->getGet('metodo_entrega');

    $ventasModel = new \App\Models\Venta_model(); // corregido nombre del modelo

    $builder = $ventasModel->builder();
    $builder->select('ventas.*, persona.nombre_persona AS nombre_persona'); // selecciona todo de ventas y nombre del cliente
    $builder->join('persona', 'persona.id_persona = ventas.id_persona');

    if ($desde && $hasta) {
        $builder->where('fecha_venta >=', $desde);
        $builder->where('fecha_venta <=', $hasta);
    }

    if ($metodoEntrega !== null && $metodoEntrega !== '') {
        $builder->where('metodo_entrega', $metodoEntrega);
    }

    $ventas = $builder->get()->getResultArray();